[
{"review": "\n\nThe Wachowski Brothers vision of a possible future takes the visual and\nsound aspects of filmmaking to a new high. Incorporating older still\nphotography with computer enhancement to the degree that appears on the\nscreen has raised the genre to a level that will be very hard-pressed by\nfilmmakers for a number of years. Acting was wonderful, script, visual,\nsound, everything about this film is a tribute to a usually overlooked\ngenre.\n"},
{"review": "\n\nRight there with Seven and Silence of the Lambs for me.  I love this film,\nand rate it a notch above some of the other great action films of our time\n(i.e., Terminator, Predator) because it has a really well thought out\n(although moderately unbelievable) story line.  A lot of thought provoking\nmaterial, and some interesting subtleties. I've seen it 10 times (I don't\nusually watch a movie more than once), and I'll watch it a few more. \nEnjoy!\n"},
{"review": "\n\ni must admit i don't have the love of this that many people i know\ndo.<br><br>Keanu is not cool, i'm sorry.  WHY is he exactly so much smarter than\neveryone else? \n It IS a geek film, its all about computers and the like, but to make it\ncool they use bullet time and such.  Just never worked for\nme.<br><br>I found the \"deja vu is the matrix going wrong speech\" hillarious, many\nthink it was clever.<br><br>Over rated by a far.\n"},
{"review": "\n\nThe matrix was the best movie i have seen ever. The special\neffects are beyond belief! I gave this movie  a 10 the first time i saw\nit and have watched it many times after that with no change. I\nsuggest this movie to all lovers of sci-fi and action.\n\n"},
{"review": "\n\nThere is no-one I know who hasn't heard of the Matrix. This, Die Hard and T2\nare my fave action films. The Matrix is the pefect action film, appealing to\neveryone, including a few excellent action scenes and an interesting love\nstory that develops over the course of the film.<br><br>The best scenes in the film are all the bullet-time scenes (The slow-motion\nkick is one). And one very excellent fight scene at the end is\nbrilliant.<br><br>See this film, BUY IT NOW!!!\n"},
{"review": "\n\nIn the matrix, there are many parallels between neo and christ. there is\nthe\nrebirth which is like being baptied because baptism is like a rebirth and\nhe\nkinda is reborn. There is also the oracle who profisied that he is the one\nwhich is like jesus being prophesied about before he was born. There is\nalso\nthe agents who are like deomns wo don't really have forms and just go\naround\ntaking over people and are also abnormally strong, fast and are linked.\n\n"},
{"review": "\n\nThis movie is great it is very cool and unique. It has great parts like\nwhen\ncreatures are magic and have tallacanetic powers and make spoons do cool\nthings. That was my favorite part. My favorite strange part is when his\nneo's mouth gets attached together.This movie is a great sci-fi movie\nwatch\nit anytime! Rated R for sci-fi seqences and images, violent content and\nbreif language. \n"},
{"review": "\n\nas the bullet time contributes to the great effects to the movie and its\nstill asuper classic action sci-fi that kicks ass and everything\nelse\n10 outa 10\nRated R for violence\n"},
{"review": "\n\nWhat makes this a great movie? The same thing that makes so many films\ngreat, the story. It is such a good idea and put onto film so well. I\ncannot\nwait for the next film(s). An original story with good acting and some\ninteresting twists. It is worth seeing just for the fact that it shows\nthat\nHollywood can make something that involves the usual action stuff and\neffects, but maintains a good plot.\n"},
{"review": "\n\nGround breaking special effects, clever storyline, and good acting make\nthis, in my opinion, the greatest action film of all time. I can't wait\ntill\nthe sequels, and I hope they make a fortune off the profits. This movie is\none of my personal favorites for a Friday night.\n"},
{"review": "\n\nSomebody says, \"What a mindjob\". It is. And it would have been a lot funnier\nif a computer simulated reincarnation of Ed Wood had directed it with a cast\nof freaks. Perfect, however, for our brave new virtual reality world. Long.\nBoring. Heads and those searching higher planes of consciousness with\n'mescalito' should keep a finger on fast forward. Reality might be too much\nto bare.\n"},
{"review": "\n\nThis film constitutes superb, superb imagination, humanistic theme, and\nstory-telling.  On top of this, the effects and martial-arts fighting are\nat\nthe same level.  The only flaws in my mind are the occasional crassness,\n(spoilers!) the lack of filmic empathy for innocent matrix slaves\nnecessarily killed in the war against \"agents\", and the final shot showing\nthe main lead alone instead of with his woman.\n"},
{"review": "\n\nThis film constitutes superb, superb imagination, humanistic theme, and\nstory-telling.  On top of this, the effects and martial-arts fighting are\nat\nthe same level.  The only flaws in my mind are the occasional crassness,\n(spoilers!) the lack of filmic empathy for innocent matrix slaves\nnecessarily killed in the war against \"agents\", and the final shot showing\nthe main lead alone instead of with his woman.\n"},
{"review": "\n\nI saw this movie when i was 11 years old, and I thought it was strange\nand a\nlittle bit too violent :-)! Now I love it.\nIt´s not my favorite movie or something like that. I just like\nit.\n\n"},
{"review": "\n\nhas anyone noticed all the parallels of this movie and the life of Jesus\nChrist?\nI have, we watched this movie during school (i goto a Christian one) and\nafter talked about all the parallels that we saw.  There were quite a\nfew, a\nlot of the talk about neo being 'the one' as was Jesus.  Look closely\nwhen\nit shows the ships  name plate thingy, it says 'mark 3 number 11' that\nverse\nhas alot to do with the movie if you read mark 3:11 in the\nbible.<br><br>peace out\n"},
{"review": "\n\nWhile I was watching The Matrix, I noticed that there are some\nsimilarities\nthat compare The Matrix to the Bible. One of the similarities that I\nnoticed\nwas Neo is raised from the dead just like Jesus was raised from dead.\nAnother similarity that I noticed was that in the end of the movie after\nNeo\ntalks on the phone he flies up into the sky and then the movie is ended.\nThis can almost resemble when Jesus raised up from the dead and raises up\nto\nheaven. \n"},
{"review": "\n\nThis movie is a b*****n movie. Not only is the special effects awesome, its\njust the movie itself. Its about a guy named Neo, who perfectly normal\nduring the day but is a computer hacker at night. He is trying to uncover\nwhat has pulled over our eyes: what is the Matrix. It gets even more\nsuspenseful and and you can't even move from your seat. totally\n10/10\n"},
{"review": "\n\nWhile I was watching The Matrix, I noticed that there are some\nsimilarities\nthat compare The Matrix to the Bible. One of the similarities that I\nnoticed\nwas Neo is raised from the dead just like Jesus was raised from dead.\nAnother similarity that I noticed was that in the end of the movie after\nNeo\ntalks on the phone he flies up into the sky and then the movie is ended.\nThis can almost resemble when Jesus raised up from the dead and raises up\nto\nheaven. \n"},
{"review": "\n\n\"No one can be told what the Matrix is\".<br><br>Great story, although not everyone agrees on that, great actors and great\nspecial effects. A must see for all sci-fi fans as myself.<br><br>Big Brother is watching you.\n"},
{"review": "\n\nOne of the best film I ever seen, it was fully loaded. A well made action\nmovie, with excellent special effect. Also with a well casted actors, it\nmakes this movie irresistable.I like this movie from the beginning to the\nend. I never seen such an exciting movie, with a well made plot and story.\nThis is really unbelievable. If you like action movies, then you wont be\ndisappointed.\n"},
{"review": "\n\ni though that it was a brilliant movie by the wachowski brothers. it\npermeated good acting, visual and sound effects and it was truly\nintriguing.\nit set a standard for all scifi movies of the action kind. it probably\nset\na trend.  the acting and shots were really great, i've never thoroughly\nbeen\nleft speechless by an action movie before but this one was something worth\nwatching.  i've never enjoyed scifi movies but the matrix was\nastounding.\n"},
{"review": "\n\nThis is the best movie that I have seen in my life,  excellent special\neffects.  I can say that if you liked it you should see the new one coming\nin 2003.  It I'm hoping is just as good or even better.  One of my favorite\nmovies A+++++++!!!\n"},
{"review": "\n\nMatrix is really one of my all-time-favourites, the story is really great,\nyou can think about all the little details for quite some time, and the\neffects are just absolute classics, and were quite often copied since. To\nmake it short: If you haven't seen this one yet, DO IT NOW! You'll like it,\neverything is just VERY well done, there were no aspects that i didn't\nlike.\n\n"},
{"review": "\n\nThis movie rocks!!! Special effects are awesome, acting is great, plot is\nvery good. Action scenes are just amazing. Great chemistry between Neo and\nTrinity and as well as Neo and Morpheus. I cant get enough of this movie.\nMore you watch it, better it gets. I cannot wait for the sequel. Rent it,\nyou will not regret it. ITS A MUST SEE!!! Ratings 10+/10\n"},
{"review": "\n\nDespite my longing to really embrace this as one of the greatest Sci-Fi\nfilms ever, I can't get over the flawed thermodynamics. Usually I have no\nproblems with logic errors but there is something about Second Law\nviolations that just upsets me to no end.\n"},
{"review": "\n\nThis is the coolest film I ever seen in my entire 18 year old life! Cool\nmusic, awesome effects and extremely good action-scenes. I recommend\nthis\nfilm 4 U who likes action combinated to great hardcore-music...\nThis film is already a classic in film-history.\n"},
{"review": "\n\nOne of the best SF movies ever. \nVery nice special effects. \nBoggling plot \n-- you look somewhat suspicious at the world around you after watching\nthis film.\n"},
{"review": "\n\nI watched this movie during my journey in Italy for the first time, in a\nlanguage that I totally didn't understand... But I was attracted by it.\nBecause of what? Perfect visual effects, and attractive story. Sometimes I\nthink, it can be true. What's the real world? An old question.\n"},
{"review": "\n\nTo tell you the truth, I wasn't expecting anything from the movie. In fact\nI\nwas quite apprehensive 'bout watching it. But boy did I enjoy\nit!\nQuite a solid story-line if not accurate, but it did the job nicely. This\nis\none of those movies that just come out of nowhere and surprise the socks\nof\nyour feet. For me The Matrix deserves 10/10 period.\n"},
{"review": "\n\nMatrix is doing it for it for the millennium as what T2 - Judgement Day did\nin for the 90's.<br><br>First rate effects, I can honestly say that this is the only film strong\nenough to rival T2. \"James Cameron eat your heart out. You never saw this\none coming\". <br><br>I first went to the cinema and was caught completely off-guard in terms of\nwhat to expect. . .  Mind - blowing is all I have to say.<br><br>Load up Matrix 2 tank.\n"},
{"review": "\n\nThis movie is one of the first, I think, that did not exaggerate the\ncomputer world like others did and fell into cliche. Of course, they kind of\nput the things in a way that everything would be possible. This movie is\nwhat Star Wars was when it first came out. The movie from guys from nowhere\nthat know how to put a story on screen. I just can't wait for the\nsequel.\n"},
{"review": "\n\nIt all looks so good, and the music is so cool, that you almost forget that\nit's a tissue paper-thin story with a religious parallel message you could\nchoke a Tibetan yak with.  Best lines in the movie:  \"I know kung fu,\" and\n\"Whoa.\"  Take both pills!\n"},
{"review": "\n\nThe matrix is one of the best sci-fi movies ever. It's remarkarbly unique\nand different and is a weird but wonderful movie. With a bunch of zany,\nwacky weird creatures (such as those octopus machine things) and interesting\ncharacters such as agent smith (Hugo Weavings) give this movie so much\ndifference to your average one. Probably takes the award for the most\nuniquness. The way the film looks is unbelievable as well. Dont forget to\nwatch this!<br><br>81%\n"},
{"review": "\n\nAn excellent, dream-like, suspenseful,action-filled, heart-beating film.  An\nexcellent film, with ground-breaking historical special effects, for all\nadult men to see.  A Man's film.   What I disliked about the film and by\nfilm makers in general is the use of slight green tint. It is unneccessarily\nused.  I would have given The Matrix the highest rating if the film was\nentirely in rich, true colors.\n"},
{"review": "\n\nIn 1999, a motion picture called \" The Matrix\" became a new\nsensation\nand captured the imagination of Audiences around the world. It\nset\na new standard in Sci-fi/action, it stars \" Keanu Reeves\" and<br><br>\"Laurence Fishburne\" who fight to free mankind in a computerized\nUniverse called \" The Matrix\". It is an amazing and spectacular\nmotion picture that you should add to your Library.<br><br>10/10 ( a perfect score to a new remarkable movie.)\n"},
{"review": "\n...effects? \nCertainly, till now. slow-mov shots, amazing fighting scenes, incredible\nexplosions. But the question is...is this enough to make a sci-fi immortal\nor it will be obsolete in 5 years?\n...story?\nBreathtaking, but not too intelligent, contains some minor spoilers. Despite\nthat, a real rollercoaster.\n...acting?\nHey it's a sci-fi not a drama. Who cares.\n...action?\n100%.\n...grade?\n8 out of 10\n"},
{"review": "\n\nThe Matrix is an outstanding visual entertainment.\nHowever, its plot is quite buggy (scenarists are confused between Watts and\nVolts, Agents may \"teleport\" and \"track\" anybody but need to bug Neo to\nfollow him...) and not that original (Stanislas Lem's Futurology Congress,\nTotal Recall, Ghosts in the Shell...) so, well, The Matrix can't be enjoyed\nmore than twice because after that, it will lose its appeal...\nWhat a pity...\n"},
{"review": "\n\nI didn't think much of this film.  The fighting sequences fell short of\nbeing effective, and the special effects were glossy but not\ninventive.\nWhat? Is Canoe Reeves s'posed to be the Messiah or something?  Give me a\nbreak.  I guess the only thing making this a movie worth watching is Joe\nPantoliano's performance as Cypher.\n"},
{"review": "\n\nThe Matrix is one of the all time best films ever created, and to know\nthat\nit has two sequels coming soon, make it even more fantastic.<br><br>You haven't lived, until you've seen (and understood) this\nmovie.\n"},
{"review": "\n\nSimply one of the best action films of all time. Only Keanu Reeves mars this\nproduction. Good acting (besides Reeves), good dialog, good story, good\neffects, good combat scenes. You must see the DVD or Collector's Edition,\nwhich explains the bullet-time photography concept. Bullet-time is now a\nhousehold phrase and an idea which is mocked in many teen spoof\nflicks.\n"},
{"review": "\n\nThe effects and concepts used in this movie had stood the test of time\nwhen\ncompared to other movies using the same theme. The potential for  reality,\nis what keeps me watching it time after time. The mix of new and old is\ndone\nso well that where or when the events takes place is not a focal\npoint.\n"},
{"review": "\n\nThe first time I watched this movie, it was really kool. TNT was airing it\nthree times: Friday, Saturday and Sunday. Awesome!!!! It was still kool\nwhen\nI watched the movie again!!! Can't wait for the sequel: The Matrix\nReloaded.\nI give the movie nine for great graphics, action, and fighting. (can't say\nanything anymore): ) All I have to say is Great movie!!!!!\n"},
{"review": "\n\nThis has to be one of the best films I have ever seen.  This movie doesnt\ncontain the usual sci-fi special effects, but incredible ones.  The plot is\nrich and the characters are well made and played well.  This is an\nexcellent\nmovie\n"},
{"review": "\n\nThe Matrix has gained a hard core following of people sucked into its\nvisually stylish world of paranoia and false realities. Yes were in Philip K\nDick (lite) world again.  The effects are great, the cast look good so it is\na shame that the script is afraid to venture into the darker corridors that\nthe film always seems about to (but never does) enter. An enjoyable if\nunsatisfying entertainment\n"},
{"review": "\n\nThe matrix is...you'll have to see it yourself.  But, it's 1st class\naction\nfun, it's got great special effects, and nevertheless, a really excellent\nplot.  If you want to enjoy a movie whenever you want to watch one, this\nis\nit.  I give it a full score...It's such a great movie.\n"},
{"review": "\n\nThis is one of the greatest movies of all time, and not due to the fact\nthat\nit's got a really wide range of appeal, because it doesn't.  People who\nlive\nfor the next little dud that only shows in two cities in the U.S. and will\nnever be seen by more than a hundred pompous people should stay\naway.<br><br>The Matrix is great due to the fact that among action films, it is so much\nbetter than anything else in the genre.  Perfect!\n"},
{"review": "\n\nIf you want to see just HOW good your home cinema setup is then this is the\ndefinitive movie to try on DVD. The visuals aren't \"bad\" either!! This is\nthe very first movie I tried with my Dolby Digital surround sound system\nand\nit certainly didn't disappoint. I still haven't found anything that will\neven come close to matching it.\n"},
{"review": "\n\nDo you want a sci-fi film that will really make you think?\nThis film makes you work for it. A real brain teaser that will get you\nasking 'what if?'. Probably one of the best films I've seen for complete\nover-all perfection, great storyline, spectacular special effects, superb\nchoice of cast (not especially a fan of Reeves but worked well for this\nrole). Definitely a lead in a new direction of special effect filming.\nEnjoy!\n"},
{"review": "\n\nThe special effects are undeniably stunning and ground-breaking with four\ntechnical oscars to back that up but the film is hollow trash. Keanu Reeves\nis humiliated by the vastly superior acting of the furniture and films that\nrely on special effects are almost always bad with the exception of \"star\nWars\", \"Blade Runner\" and \"2001: A Space Odyssey\". I can't believe this film\nis on the Top 250 list!!!!\n"},
{"review": "\n\nWhen I first heard of it, I thought...oh just another big budget movie. O\nboy what was I wrong. This movie has it all, A great Plot, Great actors\nand\nacting, filled with intense action and kungfu scenes and very good Special\neffects.<br><br>Go and see this one!!!! :-)    \n"},
{"review": "\n\nDo you like sci-fi? Action? Comic books? Amazing special effects? A rock\nsolid plot? Well then folk, welcome to the Matrix. This movie was one of\nthe\nmost innovative films in a long time and it was a great deal of fun to\nwatch. Surprisingly, thanks to his lack of major dialogue, Keanu Reeves was\nquite good in this flick! And sweet goodness, those designs by Geof Darrow\nwere amazing. All in all, see this movie. You'll be glad you did. Just\nignore the ending. Flying? What the hell?\n"},
{"review": "\n\nIts a really cool movie and I think it should be the best movie of the\nSummer of 2001. People ages 10 and up should watch it because they like\nScience-Fiction. If I saw that movie I would rate it as 10 for\nexcellent.\n"},
{"review": "\n\nEveryone told me I had to see this film as it was brilliant.<br><br>2 1/4 hours later I was thanking God that I hadn't paid to see\nit!<br><br>The storyline is just a bunch of other films and novels thrown into a\nblender... they would have gotten better acting from a few planks of wood\nwith faces drawn on them... and for the special effects they should have\ngot\na bunch of pre-school kids with crayons.<br><br>A score? 3/10 and that's purely 'cos they used Nokia 8110's!\n"},
{"review": "\n\nThe Matrix is one of the best movies I have seen! It has great stunts. I\nthought at first that it was going to be an awful gory movie with computer\nanimated stunts that you can tell are fake but boy was I wrong! It is\ndefinately the opposite! It has great stunts, and it's filmed to\nperfection!\nIt is the best movie I've seen and I think that you would like it if you\nare\ninto exellent movies.\n"},
{"review": "\n\nThe arguments for and against this film are many. Most people say it\nglamorizes violence, and while I certainly don't dispute that, I can say\nthat this isn't the most violent film out there, or even the most violent\none that I've seen. <br><br>Personally, I loved the film. I could go on and on about what I like but I'm\nsure a hundred other comments have already covered it. So I'm just going to\nurge you to see it, if you haven't already. <br><br>Go see it. My Personal Rating: 9/10\n"},
{"review": "\n\nWhat is the Matrix?<br><br>an Extremely good movie.  \nThe Matrix is about this guy named Neo. (Keanu Reeves)\nOne day his computer does somthing wierd and he is entangled in this mess\nabout saving the world.  He finds out that the world he knows is a fake\npulled over his eyes blinding him from the truth.  He Finds out that he is\nThe One and the is the only person who can save the real\nworld.\n"},
{"review": "\n\nThe message behind this movie can be applied to a billion things in our\nlives.  If you are religious, than all others walk around oblivious to the\n\"truth.\"  The same applies to those who are:  militant, libertarian,\nenlightened, highly intelligent, insane, practical, overly-sensitive,\ndown-to-earth, etc.....\nI could watch this movie a million times over and feel educated each and\nevery time.   This is an important film.\n"},
{"review": "\n\nThe Matrix is one movie that is hard to get tired of. I have seen it\nexactly\n164 times and still love it!!!!! The pros of this movie are: Amazing\neffects, really cool action, and an excellent soundtrack. The cons: Only\nreal action is at the end, at some points hard to understand. Other than\nthat, it is highly recommended.<br><br>ps                  To the MPAA,<br><br>What were you thinking when you rated this movie? Give it a PG-13 for\ncrying\nout loud! \n"},
{"review": "\n\nThis movie is great! It's kind of hard to understand at first, but once you\nget it, it a really great movie. It has awesome special effects, a great\nplot, and great characters. The Matrix will be on my top ten list for many\nyears to come.\n"},
{"review": "\n\nAmongst great action and special effects is a movie that makes you ponder\nreality.  The theme to the movie for me is: Is Ignorance Bliss?  Do you\ncontinue living day by day with blinders on to what's really around you or\nDo you dare to think out of the box?  Mix one man's quest for truth with\ngreat action and special effects and you have one amazing action film!\n\n"},
{"review": "\n\nWhat can I say? Watch it whatever you have to do! Even if you have to shoot\nsomeone to get it! This is in my top five favourate movies of all time, and\ngood reason! This has only one fault: (a) its almost as depressing as Blade\nRunner. This is pale in comerparison to the (a) comments on the nature of\nreality,(b)charicterisation and good acting and (c) mind-blowing special\neffects. Look, read the other comments if you don't believe me, but please\nwatch this film sometime in your life!\n"},
{"review": "\n\nit is not only a special effects movie, it's original and well done and it\ngives different points of view of reality: it made me think about our\nperceptions and remember my Cartesio' s studies.\nVery good!\n"},
{"review": "\n\nIf the humans are in the chambers, in sensory deprivation, from infancy, how\nis it possible that a mind or consciousness could develop to necessitate a\n'matrix'.<br><br>Ok, whatever, the humans have minds.<br><br>Why wouldn't the computers make these humans easier to handle as in\nlobotomy's or chemically maintained comas?<br><br>\n"},
{"review": "\n\nGuns, blood and language. It must have took the wachowski brothers ages to\nthink of their film storyline. Maybe it is true, maybe our minds are trapped\nin a prison but if we are, god help Keanu Reeves! He plays Neo who is\nsupposedly the ONE to take down the people who trapped humans mind in a\nprison, the agents. Great film, 9.5/10.\n"},
{"review": "\n\nMatrix is a good film but not a masterpiece.\nI really want to see nr 2 &amp; 3.\nBut do not hype over The Matrix. For you who thinks that this is the best\nSci-fi ever: well, Matrix is far away from best Sci-fi\never.\nHave you forgotten Star Wars saga? Or Terminator 1 &amp; 2? Or simply THE best\nSci-fi movie ever: ALIENS (1986).\nSo show some respect for masters like Cameron and Lucas, will\nyou?\n"},
{"review": "\n\nThis movie features a great story that shows how great Sci-Fi films can be. \nWhile it is true that the plot is mainly an excuse to show neat looking\nvisuals of people dodging bullets followed by lines like \"You are the chosen\none\", the story still is very engaging and bold.  The cinematography is also\nexcellent and impressive.  While not among the greatest films ever, this is\none of the best, if not the best Sci-fi film to come along in a few\nyears.\n"},
{"review": "\n\nI have heard about this movie, and many people recommended me to see it. \nFrankly, I had to see it two or three times to understand the plot.  I\nenjoyed the movie, it is full of fiction, and sometimes, you can believe\nthat some day, the world will be as the movie says.  Maybe, why\nnot?\n"},
{"review": "\n\nthe matrix is not a film you can explain to someone without them seeing it,\nso i won't even try. All you need to know is that it will make you and your\nfriends want to fight eachother at impossible speeds, just remember, you do\nnot know kung fu.Quality fight scenes from a film that oozes cool.\n\n"},
{"review": "\n\nThis movie is easily one of the top 10 sci-fi/action film ever but c'mon,\nthey can move faster than bullets so the heroes grab GUNS??  Stupid plot\npoint, lazy actually.  The visuals are outstanding and the mystery of\n'reality' is the selling point.. the part Keanu was born to play (because he\ndidnt have to act).  8.5/10\n"},
{"review": "\n\nThe ratings on this film are way overblown!  Excellent special effects, a\nbench mark for sure.  Yet in all other aspects of film, this movie is far\nfrom the litany of 8s,9s, and 10s it is receiving. Sure I bought the DVD as\nsoon as I left the theater but people, 2001 ASO, Alien, Blade Runner, etc.\nthose are 8-10.  This movie is little more than a 7 on special effects\nsteroids.\n"},
{"review": "\n\nIn my opinion, 'The Matrix' is the best film ever made. Combining\njaw-dropping special effects and superbly choreographed fight scenes, it\nstands out clearly from today's finest productions. Excellent acting from\nLaurence Fishburne and co. with ingenious scripting from the Wachowski\nbros.\ninvolves the viewer in a fantastic way. It's a great movie, but watch it\non\na big screen if you can! Cheers, Dom (14)\n"},
{"review": "\n\nWhat can I say this is the best film ever made. It has everything, the best\nspecial effects in a movie, action, good script, great dialogue and the\ncoolest clothes, sunglasses and phones ever. THE MATRIX\nRULES!!!!!!\n"},
{"review": "\n\nThis is a great action movie, and the best I have ever seen! I only saw this\nthe other night, but I enjoyed it so much that I went out and bought the DVD\ntoday!\nThe plot is great, the acting is superb and the action is brilliant! The\nKung Fu scene is nearly up to Jackie Chan standards, and the gun battle in\nthe lobby is amazing.\nThis film has great special effects, and Carrie-Anne Moss is outstanding as\nTrinity.\nI can't wait for \"The Matrix 2\"!\n"},
{"review": "\n\n\"Mankind is like a virus.\" So the agent says, and boy does that ever ring\ntrue. This is perhaps the one moment in the film that does provoke thought.\nThe rest of it however, is like Star Wars Ep. 1 - being crushed by a huge,\nendless, almost pointless but philosophical and entertaining video-game\nwhich dares ask the question \"what would it be like to be a computer virus.\"\n\n"},
{"review": "\n\ni saw the trailer to this movie , and i was loking forward to the special\neffects.i saw it.every single scene of a special effect was on the\ntrailer.this movie movie blows.and without the special effects you would\nfind this movie very BORING! so if your just going to see this movie\nbecause\nof the special effects  go see the trailer!any comments?<br><br>\n"},
{"review": "\n\nI first thought that this movie would be no more than the typical\naction-packed summer movie.  But as you get more into the movie you\nrealize\nthat behind the action scenes and special effects there is an engaging and\nintelligent plot driving the entire movie.  While not all viewers would\nenjoy this, I think that everyone should at least give this movie a try.\nIt\nis not to be missed.\n"},
{"review": "\n\nMake sure you don't talk.  If you talk, you won't get it.  Don't watch all\nthese comedies and expect to get it the first time.  Dig deep and think\nabstract.  I liked it.  It will have you saying stuff like\n\"cool.\"\n"},
{"review": "\n\nThis movie will certainly remain my favorite for quite some time.  The\naction and movie affects are engrossing, and it will be the standard other\nmovies are compared against for at least a decade.  The story was\ncreative,\nthe acting was supurb, and overall I can't think of a single\nflaw.<br><br>Great movie!  Buy the DVD and watch it over and over.\n"},
{"review": "\n\nFantastic movie that really only works when your sound system is excellent.\nI've watched this one at least ten times, and the difference in the\nexperience is remarkable.  I've never known a movie to hinge so much on its\nsound quality.\nBeautifully, hypnotically photographed, in a comic book storyboard style.\nKeanu is surrounded by top notch actors, and he rocks as Neo.  So what if\nthe philosophy here is half-baked New Ageism; suspend your Critic and Listen\nto this fun action feast.\n"},
{"review": "\n\nI want not 2 but 9 sequels just like Star Wars. It can be done.  Keanu\nReeves best movie since Speed and Devil's Advocate. Lawrence Fishburne is\ngood and Carrie Ann Moss is absolutely stunning. The action sequences are\namazing and set a new bench mark for future movies.\n"},
{"review": "\n\nAnd, wow!  Just as I was surfing the IMDb site, I wondered: \"What IS the\nstatus for 'The Matrix 2'? And about the third, as well... Where are they\nfilming? Where....\"<br><br>And low and behold... it came to me.  What if this whack-ass Matrix mindtrip\nis only three to an enormous 9-episode venture similar to (HELLO!!!) 'Star\nWars'!<br><br>My God!  Do you have any idea how insane that would be.  Okay, just a\nthought.  Go back to your life now.<br><br>Love,<br><br>Comm Major\n"},
{"review": "\n\nThis is the best movie I have ever seen!!  Keanu Reeves did an awesome job,\nbut not quite as awesome as Lawrence Fishbourne.  The plot is eerily\npossible, and it makes you think about the world that we live in.  Who\nknows, we might actually live in something similar to the matrix.  If you\nhave not seen this movie, I recommend that you do!\n"},
{"review": "\n\nThe movie had all the elements of great science fiction and action and\nbreathed fresh life into an almost stale genre.  While over long and not\nplaying as well on video it has an originality which is lacking from most\nbig\nbudget films.\n"},
{"review": "\n\nBecause I agree with the positive comments about this film, I'm not even\ngonna go there except to chime in about it being one of the best films I've\never seen.  What struck me was Hugo Weaving's range.  After seeing \"Bedrooms\nand Hallways\" I can't even believe it's the same guy.  Everything about him\nis different.  His voice, his carriage.  I know that's why they call it\nacting, but Agent Smith is a huge departure from anything else I've seen him\nin.\n"},
{"review": "\n\nA computer hacker attempts to destroy a seemingly invincible artificial\nintelligence that is controlling human life.  Potentially intelligent,\nphilosophical plot and some fine supporting acting sunk by comic book\nscript, undeveloped main character and excessive special effects. (Rating:\nB)\n"},
{"review": "\n\nThe first time I watched the Matrix i did not think it was anything special,\nbut upon watching it a second time i realised just how good both the\nstoryline and the special effects are.<br><br>After watching the film you start to wonder and then it starts to mess with\nyour head.\n"},
{"review": "\n\nAn example of science-fiction movie based on philosophy and deep thought.\nGreat visual effects, great performances. A movie to see more and more. If\nyou have a personal idea of virtual reality and parallel histories, well\n\"The Matrix\" will help you to find something you didn't\nknow.\n"},
{"review": "\n\nGets better every time I watch it.  A mind boggling concept behind the\nplot.\nSometimes I think about it and get the shivers.   Some of the action\nscenes\nare already classics for their originality and are being duplicated in\nother\nshows, TV and movies.  My favorite Keanu movie. \n"},
{"review": "\n\nAs far as the genre is considered this is the all time single most\nbeautiful\npiece of Art ever captured on film. The acting I wouldn't consider to be\nthe greatest of our time but the vibe and the overall message was by far\nthe\nmost wonderful visual feast I have ever had the pleasure of viewing. What\na\nbrilliant movie by The W Bros. these guys kick serious !@!@#@$! Also a\nmust\nsee is the movie \"Bound\" if you like anything by The W\nBros.\n"},
{"review": "\n\nWhen I went to the movies to watch The Matrix I admit that I wasn't\nexpecting for a good movie at all but when it started I realized how wrong\nI\nwas. This movie is great! It depicts in a very interesting way how the\nhuman\nbeing is living nowadays. Certainly, one of the best sci-fi movies\never!\n"},
{"review": "\n\nWhat will people say 50 years from now about the Matrix??\nThey'll call it a classic.  It's already a classic now.\nFrom start to finish, it's a joyride of bullet dodging, mind-bending, a$$\nkickin' special effects with the perfect people for the part.  I can't\nwait\nfor the sequels.  The Matrix trilogy will surely be the \"Star Wars\" of the\ncomputer generation.\n"},
{"review": "\n\nFor you, who haven´t seen this one, i must say:\nThis is one of the worst movies in the nineties, together with Lost World\nand Wild Wild West...\nOkay, the action scenes is nice, but the acting, the plot is really really\nAWFUL...\n"},
{"review": "\n\nIf you go into this film with no expectations then this film is visually\nTHE\nBEST I'VE EVER SEEN. Keanu Reeves kicks butt bigtime.<br><br>However the plot is a bit twisted, I wont spoil it for everyone, but the\nmatrix is a really creepy idea.<br><br>Nevertheless, if when you go to the cinema you want to see \"goodies\"\nbeating\n\"baddies\" this film won't disappoint. \n"},
{"review": "\n\nIf you have not seen \"The Matrix\" you must.  Keanu Reeves is hot.  The\nspecial effects are totally awesome.  There are plenty of guns.  The plot\nwill make you question the reality of reality.  Absolutely a must see!!!\nMy\nfavorite movie by far!\n"},
{"review": "\n\nThis movie is awesome. Not once do you get bored... you just fly through\nit,\nand at the end you look back and say \"WOW! This movie is sweet!\" And then,\nyou never sleep for 5 nights because you are thinking about the Matrix...\nand about what the Oracle said to Neo!<br><br>I really believe this movie is the best sci-fi movie ever... better than\nstar wars for sure.<br><br>\n"},
{"review": "\n\nI loved this movie from the first time i saw it. Very nice music, and\nmind-blowing special effects. Superb plot. Besides, it has Keanu Reeves in\nit, which automatically makes it awesome. If the sequels are half as good\nas\nthe original, I'll be first in line at the theater. I give it a 2-thumbs\nup!\n"},
{"review": "\n\nThis film is a must watch for anyone interested in cyberpunk.  A movie that\ngets live-action anime onto film.  Some of the best martial arts fights\never.  And they are even more amazing when you know that the actors are\ndoing all the fighting themselves.  Go see this movie at all\ncosts.\n"},
{"review": "\n\nThought provoking with fast paced martial arts action.  Every time I watch\nthis movie I find something new I hadn't seen before.  One of my favorite\nmovies.  At the end of this movie you'll either be thinking \"Woah!\" or\n\"What\nthe....?!\"\n"},
{"review": "\n\nWay cool movie.  I saw it two days ago with my best friend.  She<br><br>was raving it was so neat.  So I watched it.  I discovered, man,<br><br>was she right!  I liked Switch and Trinity.  Morpheous was<br><br>pretty cool too.  I've never seen any other Keanu Reaves movies<br><br>so I can't comment on him.  Definately a find.  Definate\n10\n"},
{"review": "\n\nULTRA COOL ACTION through the movie. Keanu Reeves and Laurence Fishburne are\ngood, good plot.Great action, ok actors, very good special effects...hellofa\nmovie! 8.75/10 and not a point more! This movie is good but not great.\nEVERYONE should see it atleast once! I really wait for\nsequels.\n"}
]